[
  {
    "year": 2025,
    "type": "journal",
    "title": "Interactive Texture Segmentation of 3D Scanned Models",
    "authors": "Koki Madono, Takeo Igarashi, Hiroharu Kato, Taisuke Hashimoto, Fabrice Matulic, Tsukasa Takagi, Keita Higuchi",
    "venue": "IEEE Computer Graphics and Applications",
    "links": [
      { "label": "PDF", "url": "https://diglib.eg.org/items/9872e9ad-5498-499f-a10e-94a5f825a68d" }
    ],
    "abstract": "In 3D model scanning, the raw texture of a 3D model often requires segmentation into distinct regions to apply different material properties to each region. Current methods, such as manual segmentation, are labor-intensive, while automatic segmentation techniques lack user control. We propose an interactive tool that combines automatic segmentation with minimal manual intervention, striking an optimal balance between efficiency and control. Following a multiview automatic segmentation process that divides the texture into small subsegments, users cluster the subsegments into segments by drawing simple scribbles in the 3D model view. We show that our approach results in more detailed subsegments compared to automatic segmentation approaches. Furthermore, a user study confirms that our approach improves segmentation accuracy and quality compared to manual segmentation with standard 3D computer graphics software. This research paves the way to more efficient texture segmentation in 3D model scanning.",
    "bibtex": "@article{MadonoCGA2025,\n  author  = {Koki Madono and Takeo Igarashi and Hiroharu Kato and Taisuke Hashimoto and Fabrice Matulic and Tsukasa Takagi and Keita Higuchi},\n  title   = {Interactive Texture Segmentation of 3D Scanned Models},\n  journal = {IEEE Computer Graphics and Applications},\n  year    = {2025}\n}",
    "thumb": "images/cga2025.jpg"
  },
  {
    "year": 2023,
    "type": "conference",
    "title": "Data-Driven Ink Painting Brushstroke Rendering",
    "authors": "Koki Madono, Edgar Simo-Serra",
    "venue": "Computer Graphics Forum (Pacific Graphics)",
    "links": [
      { "label": "PDF", "url": "pdfs/pg2023.pdf" }
    ],
    "abstract": "We propose a data-driven approach to synthesize ink painting brushstrokes. Using example strokes, our method models stroke appearance and dynamics to generate plausible results that preserve characteristic textures and tapering while remaining controllable for design and illustration workflows.",
    "bibtex": "@article{MadonoPG2023,\n  author  = {Koki Madono and Edgar Simo-Serra},\n  title   = {Data-Driven Ink Painting Brushstroke Rendering},\n  journal = {Computer Graphics Forum},\n  year    = {2023}\n}",
    "thumb": "images/pg2023.jpg"
  }
]
